# -*- coding: utf-8 -*-

genre = {
    '': '', 'Биографический': '17', 'Боевик': '7', 'Вестерн': '8', 'Военный': '18', 'Детектив': '5', 'Документальный': '26', 
    'Драма': '2', 'Исторический': '14', 'Комедия': '1', 'Комиксы': '19', 'Криминал': '13', 'Мелодрама': '21', 'Мистика': '6', 
    'Мюзикл': '23', 'Научная фантастика': '25', 'Приключенческий': '9', 'Семейный': '20', 'Спорт': '24', 'Триллер': '4', 
    'Ужасы': '11', 'Фантастика': '3', 'Фэнтези': '12'
    }

year = {
    '': '', '2022': '2022', '2019-2021': '2019', '2015-2018': '2015', '2011-2014': '2011', '2007-2010': '2007', 
    '2003-2006': '2003', '1999-2002': '1999', 'до 1999': '1970'
    }

country = {
    '': '', 'Австралия': '19', 'Австрия': '25', 'Великобритания': '2', 'Венгрия': '6', 'Германия': '5', 'Дания': '27', 'Ирландия': '7', 
    'Испания': '23', 'Италия': '24', 'Канада': '3', 'Корея': '20', 'Мексика': '26', 'Польша': '22', 'США': '1', 'Франция': '21', 
    'Швеция': '28', 'ЮАР': '8', 'Япония': '4'
    }

channel = {
    '': '', 'CBS All Access': '67', 'A&amp;E': '19', 'ABC': '1', 'Adult Swim': '18', 'Amazon Prime Video': '85', 'AMC': '5', 'AMC+': '84', 
    'Apple TV+': '69', 'Audience Network': '56', 'BBC': '24', 'BBC America': '27', 'BBC One': '51', 'BBC three': '46', 'BBC Two': '20', 
    'Canal+': '82', 'Cartoon Network': '29', 'CBC': '74', 'CBS': '4', 'Channel 4': '33', 'CINEMAX': '53', 'Citytv': '75', 'Comedy Central': '39', 
    'Crackle': '42', 'CTV': '36', 'CW Seed': '50', 'DC Universe': '59', 'Discovery': '26', 'DISNEY XD': '45', 'Disney+': '70', 'EL REY NETWORK': '43', 
    'Epix': '65', 'FOX': '21', 'France 2': '86', 'Freeform': '54', 'FX': '7', 'FXX': '9', 'HBO': '14', 'HBO Asia': '77', 'HBO Max': '79', 
    'History': '28', 'hulu': '52', 'IMDb TV': '83', 'ITV': '49', 'Lifetime': '10', 'Machinima': '22', 'Movie Network': '37', 'MTV': '47', 
    'National Geographic Channel': '64', 'NBC': '2', 'Netflix': '23', 'Nickelodeon': '73', 'Paramount Network': '58', 'Paramount+': '81', 
    'Peacock': '78', 'Quibi': '76', 'REELZ': '32', 'RTL': '35', 'Science': '34', 'Showcase': '16', 'Showtime': '15', 'Shudder': '71', 'Sky Arts': '13', 
    'Sky Atlantic': '72', 'Sky Go': '80', 'Sky One': '63', 'Space': '25', 'Spike': '55', 'Stan': '87', 'Stargate Command': '57', 'Starz': '12', 
    'Syfy': '8', 'Syndication': '68', 'tbs': '41', 'The CW': '3', 'TNT': '11', 'UPN': '30', 'USA Network': '40', 'VH1': '66', 'WGN america': '44', 
    'YouTube Originals': '62'
    }

types = {
    '': '', 'Анимация': '58', 'Антиутопия': '50', 'Антология': '21', 'Байкеры': '32', 'Будущее': '44', 'Вампиры': '5', 'Веб-сериал': '7', 'Ведьмы': '22', 
    'Викинги': '40', 'Военные': '43', 'Врачи': '27', 'Гангстеры': '4', 'Зомби': '11', 'Инопланетяне': '23', 'Космос': '28', 'Кроссовер': '49', 'Магия': '39', 
    'Мини-сериал': '9', 'Мистические существа': '25', 'Музыка': '59', 'Мультфильм': '15', 'Оборотни': '24', 'Параллельный мир': '51', 'Пираты': '36', 
    'По книге': '3', 'По комиксам': '54', 'По комиксам Archie Comics': '48', 'По комиксам Dark Horse': '38', 'По комиксам DC Comics': '26', 
    'По комиксам Dynamite Entertainment': '55', 'По комиксам Image': '35', 'По комиксам Marvel': '1', 'По комиксам Shogakukan': '56', 'По комиксам Vertigo': '57', 
    'По компьютерной игре': '8', 'По реальным событиям': '16', 'По сериалу': '52', 'По фильму': '18', 'Полицейские': '45', 'Постапокалипсис': '31', 
    'Преступники': '47', 'Приквел': '13', 'Процедурал': '46', 'Ремейк': '12', 'Роботы': '33', 'Сверхспособности': '20', 'Сверхъестественное': '30', 
    'Сиквел': '42', 'Слэшер': '41', 'Спин-офф': '10', 'Странствие во времени': '29', 'Супергерои': '2', 'Ученые': '53', 'Хакеры': '37', 'Шпионы': '17', 
    'Эпидемия': '19'
    }

status = {'все': '0', 'новые': '1', 'снимающиеся': '2', 'завершенные': '5', 'Избранные': '99'}

sort = {'По новизне': '3', 'По алфавиту': '2', 'По рейтингу': '1'}

form = {'Сериалы': 'serial', 'Фильмы': 'movies'}

alphabet = {
    '': '', 'ВCE': '', '0..9': '999', 'А': '1', 'Б': '2', 'В': '3', 'Г': '4', 'Д': '5', 'Е': '6', 'Ж': '8', 'З': '9', 'И': '10', 'Й': '11', 
    'К': '12', 'Л': '13', 'М': '14', 'Н': '15', 'О': '16', 'П': '17', 'Р': '18', 'С': '19', 'Т': '20', 'У': '21', 'Ф': '22', 'Х': '23', 
    'Ц': '24', 'Ч': '25', 'Ш': '26', 'Щ': '27', 'Э': '31', 'Ю': '32', 'Я': '33', 'A': '51', 'B': '52', 'C': '53', 'D': '54', 'E': '55', 
    'F': '56', 'G': '57', 'H': '58', 'I': '59', 'J': '60', 'K': '61', 'L': '62', 'M': '63', 'N': '64', 'O': '65', 'P': '66', 'Q': '67', 
    'R': '68', 'S': '69', 'T': '70', 'U': '71', 'V': '72', 'W': '73', 'X': '74', 'Y': '75', 'Z': '76'
    }

update_info = '[B][COLOR=darkorange]Version 1.2.8[/COLOR][/B]\n\
\n\
*** [COLOR=gold]Изменения в настройках Разблокировки[/COLOR]\n\
\n\
- Добавлены строки для адреса\n\
- Для Antizapret - стоит адрес до PAC файла (использую для Яндекса, Гугла и т.п.)\n\
- Для LostFilm стоит сразу адрес прокси. Можно вводить любой рабочий адрес, но в указанном формате.\n\
'